//COMPCOB  JOB (COMPILA),'COMPILAR COBOL',CLASS=A,MSGCLASS=X,
//             MSGLEVEL=(1,1),USER=HERC01,PASSWORD=HERC01
//COB      EXEC PGM=IKFCBL00,
//             PARM='LOAD,SUPMAP,SIZE=2048K,BUF=1024K,LIB'
//SYSLIB   DD  DSN=HERC01.COBOL.COPYLIB,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSPUNCH DD  SYSOUT=*
//SYSIN    DD  DSN=HERC01.COBOL.SOURCE(GERASALD),DISP=SHR
//SYSLIN   DD  DSN=&&LOADSET,DISP=(MOD,PASS),
//             UNIT=SYSDA,SPACE=(TRK,(10,10)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=3200)
//SYSUT1   DD  SPACE=(CYL,(1,1)),UNIT=SYSDA
//SYSUT2   DD  SPACE=(CYL,(1,1)),UNIT=SYSDA
//SYSUT3   DD  SPACE=(CYL,(1,1)),UNIT=SYSDA
//SYSUT4   DD  SPACE=(CYL,(1,1)),UNIT=SYSDA
//LKED     EXEC PGM=IEWL,PARM='LIST,LET,XREF,MAP',
//             COND=(5,LT,COB)
//SYSLIN   DD  DSN=&&LOADSET,DISP=(OLD,DELETE)
//         DD  DDNAME=SYSIN
//SYSLMOD  DD  DSN=HERC01.LOAD(GERASALD),DISP=SHR
//SYSLIB   DD  DSN=SYS1.COBLIB,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSUT1   DD  SPACE=(CYL,(1,1)),UNIT=SYSDA
/*