//PRJ5COB  JOB (EXEC),'GERA SALDOS',CLASS=A,MSGCLASS=X,
//             MSGLEVEL=(1,1),USER=HERC01,PASSWORD=HERC01
//STEP01   EXEC PGM=SORT,REGION=1024K
//STEPLIB  DD DSN=SYS1.LINKLIB,DISP=SHR
//SORTLIB  DD DSN=SYS1.SORTLIB,DISP=SHR
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DSN=HERC01.ARQCLIEN.TXT,DISP=SHR
//         DD DSN=HERC01.ARQNOVOS.TXT,DISP=SHR
//SORTOUT  DD DSN=&&SORTED,DISP=(NEW,PASS),
//            UNIT=SYSDA,
//            SPACE=(CYL,(1,1),RLSE),
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=8000)
//SYSIN    DD *
  SORT FIELDS=(39,4,CH,A)
/*
//STEP02   EXEC PGM=GERASALD
//STEPLIB  DD DSN=HERC01.LOAD,DISP=SHR
//ENTRADA  DD DSN=&&SORTED,DISP=(OLD,DELETE)
//RELAT    DD DSN=HERC01.SAIDAREL.TXT,
//            DISP=OLD,
//            SPACE=(TRK,(5,5),RLSE),
//            UNIT=SYSDA,
//            DCB=(RECFM=FB,LRECL=132,BLKSIZE=1320)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
/*