IDENTIFICATION DIVISION.
       PROGRAM-ID. GERASALD.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ARQ-ENTRADA ASSIGN TO ENTRADA
             ORGANIZATION IS SEQUENTIAL.
           SELECT ARQ-SAIDA ASSIGN TO RELAT
             ORGANIZATION IS SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD  ARQ-ENTRADA
           LABEL RECORD IS STANDARD
           BLOCK CONTAINS 0 RECORDS.
       01  REG-CONTA.
         05 NUM-CONTA    PIC 9(08).
         05 NOME-CLIENTE PIC X(30).
         05 AGENCIA      PIC 9(04).
         05 TIPO-CONTA   PIC X(01).
         05 SALDO        PIC S9(09)V99 SIGN TRAILING SEPARATE.

       FD  ARQ-SAIDA
           LABEL RECORD IS STANDARD
           BLOCK CONTAINS 0 RECORDS.
       01  REG-RELAT      PIC X(132).

       WORKING-STORAGE SECTION.
       01  WS-CONTROLES.
         05 FIM-ARQ      PIC X(01) VALUE 'N'.
         05 WS-AG-ATUAL  PIC 9(04) VALUE ZEROS.
       01  WS-TOTAIS.
         05 TOT-LIDAS    PIC 9(05) VALUE ZEROS.
         05 TOT-AGENCIA  PIC S9(13)V99 VALUE ZEROS.
         05 TOT-GERAL    PIC S9(13)V99 VALUE ZEROS.

       01  WS-CABECALHO-1.
         05 FILLER       PIC X(132) VALUE ALL '-'.
       01  WS-CABECALHO-2.
         05 FILLER       PIC X(15) VALUE SPACES.
         05 FILLER       PIC X(30) VALUE 'ESTATISTICAS BANCARIAS'.

       01  WS-DETALHE.
         05 FILLER       PIC X(07) VALUE 'CONTA: '.
         05 WS-DET-CONTA PIC 9(08).
         05 FILLER       PIC X(07) VALUE ' | AG: '.
         05 WS-DET-NOME  PIC X(30).
         05 FILLER       PIC X(07) VALUE ' | AG: '.
         05 WS-DET-AG    PIC 9(04).
         05 FILLER       PIC X(09) VALUE ' | TIPO: '.
         05 WS-DET-TIPO  PIC X(01).
         05 FILLER       PIC X(10) VALUE ' | SALDO: '.
         05 WS-DET-SALDO PIC -ZZZ,ZZZ,ZZ9.99.

       01  WS-RODAPE-AGENCIA.
         05 FILLER       PIC X(22) VALUE '*** TOTAL DA AGENCIA '.
         05 WS-ROD-AG    PIC 9(04).
         05 FILLER       PIC X(03) VALUE ' = '.
         05 WS-ROD-TOTAG PIC -ZZZ,ZZZ,ZZ9.99.

       01  WS-RODAPE-GERAL-1.
         05 FILLER       PIC X(23) VALUE 'TOTAL DE CONTAS LIDAS: '.
         05 WS-ROD-LIDAS PIC 9(05).
       01  WS-RODAPE-GERAL-2.
         05 FILLER       PIC X(20) VALUE 'SALDO TOTAL GERAL:  '.
         05 WS-ROD-GERAL PIC -ZZZ,ZZZ,ZZ9.99.

       PROCEDURE DIVISION.
       0000-PRINCIPAL.
         PERFORM 1000-INICIAR
         PERFORM 2000-PROCESSAR UNTIL FIM-ARQ = 'S'
         PERFORM 3000-FINALIZAR
         STOP RUN.

       1000-INICIAR.
         OPEN INPUT ARQ-ENTRADA
         OPEN OUTPUT ARQ-SAIDA
         PERFORM 4000-LER-ARQUIVO
         IF FIM-ARQ = 'N'
           MOVE AGENCIA TO WS-AG-ATUAL
         END-IF.

       2000-PROCESSAR.
         IF AGENCIA NOT = WS-AG-ATUAL
           PERFORM 5000-QUEBRA-AGENCIA
         END-IF

         MOVE NUM-CONTA TO WS-DET-CONTA
         MOVE NOME-CLIENTE TO WS-DET-NOME
         MOVE AGENCIA TO WS-DET-AG
         MOVE TIPO-CONTA TO WS-DET-TIPO
         MOVE SALDO TO WS-DET-SALDO
         WRITE REG-RELAT FROM WS-DETALHE

         ADD 1 TO TOT-LIDAS
         ADD SALDO TO TOT-AGENCIA
         ADD SALDO TO TOT-GERAL

         PERFORM 4000-LER-ARQUIVO.

       3000-FINALIZAR.
         IF TOT-LIDAS > 0
           PERFORM 5000-QUEBRA-AGENCIA
         END-IF

         MOVE TOT-LIDAS TO WS-ROD-LIDAS
         MOVE TOT-GERAL TO WS-ROD-GERAL

         WRITE REG-RELAT FROM WS-CABECALHO-1
         WRITE REG-RELAT FROM WS-CABECALHO-2
         WRITE REG-RELAT FROM WS-CABECALHO-1
         WRITE REG-RELAT FROM WS-RODAPE-GERAL-1
         WRITE REG-RELAT FROM WS-RODAPE-GERAL-2
         WRITE REG-RELAT FROM WS-CABECALHO-1

         CLOSE ARQ-ENTRADA
         CLOSE ARQ-SAIDA.

       4000-LER-ARQUIVO.
         READ ARQ-ENTRADA
           AT END
             MOVE 'S' TO FIM-ARQ
         END-READ.

       5000-QUEBRA-AGENCIA.
         MOVE WS-AG-ATUAL TO WS-ROD-AG
         MOVE TOT-AGENCIA TO WS-ROD-TOTAG
         WRITE REG-RELAT FROM WS-RODAPE-AGENCIA
         MOVE SPACES TO REG-RELAT
         WRITE REG-RELAT
         
         MOVE AGENCIA TO WS-AG-ATUAL
         MOVE ZEROS TO TOT-AGENCIA.