       01  WS-REG-CLIENTE.                                          
         05 CLI-CONTA               PIC 9(08).                    
         05 CLI-NOME                PIC X(30).                    
         05 CLI-FILIAL              PIC 9(04).                    
         05 CLI-MODALIDADE          PIC X(01).                    
         05 CLI-MONTANTE            PIC S9(09)V99.                
         05 CLI-SINAL               PIC X(01).                     
         05 FILLER                  PIC X(25).