       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROCESSA.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       OBJECT-COMPUTER. IBM-370.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ARQ-CONTAS   ASSIGN TO UT-S-ARQCNT.
           SELECT ARQ-MOVIM    ASSIGN TO UT-S-ARQMOV.
           SELECT ARQ-CNT-OUT  ASSIGN TO UT-S-CNTUPDT.
           SELECT RELATORIO    ASSIGN TO UR-S-RELAT.
           SELECT ARQ-FALHAS   ASSIGN TO UR-S-FALHAS.
       DATA DIVISION.
       FILE SECTION.
       FD  ARQ-CONTAS
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 44 CHARACTERS
           BLOCK CONTAINS 0 RECORDS.
       01  REG-CONTA.
           05 CNT-ID           PIC 9(05).
           05 CNT-NOME         PIC X(30).
           05 CNT-SALDO        PIC 9(09).
       FD  ARQ-MOVIM
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 20 CHARACTERS
           BLOCK CONTAINS 0 RECORDS.
       01  REG-MOVIMENTO.
           05 MOV-CNT-ID       PIC 9(05).
           05 MOV-ID           PIC 9(05).
           05 MOV-TIPO         PIC X(01).
           05 MOV-VALOR        PIC 9(09).
       FD  ARQ-CNT-OUT
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 44 CHARACTERS
           BLOCK CONTAINS 0 RECORDS.
       01  REG-CNT-OUT         PIC X(44).
       FD  RELATORIO
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 80 CHARACTERS.
       01  REG-RELATORIO       PIC X(80).
       FD  ARQ-FALHAS
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 80 CHARACTERS.
       01  REG-FALHA           PIC X(80).
       WORKING-STORAGE SECTION.
       01  WS-STATUS-ARQ.
           05 WS-ST-CONTAS     PIC X(02) VALUE SPACES.
           05 WS-ST-MOVIM      PIC X(02) VALUE SPACES.
       01  WS-CHAVES.
           05 WS-CHV-CNT       PIC X(05) VALUE SPACES.
           05 WS-CHV-MOV       PIC X(05) VALUE SPACES.
       01  WS-CONTADORES.
           05 WS-QTD-CNT-PROC  PIC 9(06) VALUE ZEROS.
           05 WS-QTD-MOV-PROC  PIC 9(06) VALUE ZEROS.
           05 WS-QTD-ENTRADAS  PIC 9(06) VALUE ZEROS.
           05 WS-QTD-SAIDAS    PIC 9(06) VALUE ZEROS.
           05 WS-QTD-FALHAS    PIC 9(06) VALUE ZEROS.
       01  WS-TOT-CONTA.
           05 WS-CNT-TOT-ENT   PIC 9(09) VALUE ZEROS.
           05 WS-CNT-TOT-SAI   PIC 9(09) VALUE ZEROS.
       01  WS-LINHA-REL-1.
           05 FILLER           PIC X(08) VALUE 'CONTA: '.
           05 WS-REL-CNT-ID    PIC 9(05).
           05 FILLER           PIC X(67) VALUE SPACES.
       01  WS-LINHA-REL-2.
           05 FILLER           PIC X(16) VALUE 'TOTAL ENTRADAS: '.
           05 WS-REL-ENTRADAS  PIC 9(09).
           05 FILLER           PIC X(55) VALUE SPACES.
       01  WS-LINHA-REL-3.
           05 FILLER           PIC X(14) VALUE 'TOTAL SAIDAS: '.
           05 WS-REL-SAIDAS    PIC 9(09).
           05 FILLER           PIC X(57) VALUE SPACES.
       01  WS-LINHA-FALHA.
           05 FILLER           PIC X(07) VALUE 'FALHA: '.
           05 WS-MSG-FALHA     PIC X(34).
           05 FILLER           PIC X(04) VALUE 'ID '.
           05 WS-ID-FALHA      PIC 9(05).
           05 FILLER           PIC X(30) VALUE SPACES.
       01  WS-LINHA-TOTAIS.
           05 WS-DESC-TOTAIS   PIC X(25).
           05 WS-VALOR-TOTAIS  PIC 9(06).
           05 FILLER           PIC X(49) VALUE SPACES.
       PROCEDURE DIVISION.
       0000-INICIO SECTION.
           PERFORM 1000-ABRIR-ARQUIVOS.
           PERFORM 2000-LER-CONTA.
           PERFORM 3000-LER-MOVIMENTO.
           PERFORM 4000-PROCESSAR-MERGE
               UNTIL WS-CHV-CNT = HIGH-VALUES
                 AND WS-CHV-MOV = HIGH-VALUES.
           PERFORM 8000-ENCERRAR.
           STOP RUN.
       1000-ABRIR-ARQUIVOS SECTION.
           OPEN INPUT  ARQ-CONTAS
                       ARQ-MOVIM
                OUTPUT ARQ-CNT-OUT
                       RELATORIO
                       ARQ-FALHAS.
       2000-LER-CONTA SECTION.
           READ ARQ-CONTAS
               AT END
                   MOVE HIGH-VALUES TO WS-CHV-CNT.
           IF WS-CHV-CNT NOT = HIGH-VALUES
               MOVE CNT-ID TO WS-CHV-CNT
               MOVE ZEROS  TO WS-CNT-TOT-ENT
               MOVE ZEROS  TO WS-CNT-TOT-SAI.
       3000-LER-MOVIMENTO SECTION.
           READ ARQ-MOVIM
               AT END
                   MOVE HIGH-VALUES TO WS-CHV-MOV.
           IF WS-CHV-MOV NOT = HIGH-VALUES
               MOVE MOV-CNT-ID TO WS-CHV-MOV.
       4000-PROCESSAR-MERGE SECTION.
           IF WS-CHV-CNT = WS-CHV-MOV
              PERFORM 5000-APLICAR-MOVIMENTO
              PERFORM 3000-LER-MOVIMENTO
           ELSE
              IF WS-CHV-CNT < WS-CHV-MOV
                 PERFORM 6000-GRAVAR-CONTA
                 PERFORM 2000-LER-CONTA
              ELSE
                 PERFORM 7000-FALHA-CONTA-INEX
                 PERFORM 3000-LER-MOVIMENTO.
       5000-APLICAR-MOVIMENTO SECTION.
           IF MOV-VALOR = ZEROS
             PERFORM 5100-FALHA-VALOR-ZERO
           ELSE
              IF MOV-TIPO = 'C'
                 PERFORM 5200-PROCESSAR-ENTRADA
              ELSE
                 IF MOV-TIPO = 'D'
                    PERFORM 5300-PROCESSAR-SAIDA
                 ELSE
                    PERFORM 5400-FALHA-TIPO-INV.
       5100-FALHA-VALOR-ZERO SECTION.
           MOVE 'VALOR DE MOVIMENTO INVALIDO - ' TO WS-MSG-FALHA.
           MOVE MOV-CNT-ID TO WS-ID-FALHA.
           WRITE REG-FALHA FROM WS-LINHA-FALHA.
           ADD 1 TO WS-QTD-FALHAS.
       5200-PROCESSAR-ENTRADA SECTION.
           ADD MOV-VALOR TO CNT-SALDO.
           ADD MOV-VALOR TO WS-CNT-TOT-ENT.
           ADD 1 TO WS-QTD-ENTRADAS.
           ADD 1 TO WS-QTD-MOV-PROC.
       5300-PROCESSAR-SAIDA SECTION.
           IF CNT-SALDO NOT < MOV-VALOR
              SUBTRACT MOV-VALOR FROM CNT-SALDO
              ADD MOV-VALOR TO WS-CNT-TOT-SAI
              ADD 1 TO WS-QTD-SAIDAS
              ADD 1 TO WS-QTD-MOV-PROC
           ELSE
              MOVE 'SALDO INSUFICIENTE - '    TO WS-MSG-FALHA
              MOVE MOV-CNT-ID                 TO WS-ID-FALHA
              WRITE REG-FALHA FROM WS-LINHA-FALHA
              ADD 1 TO WS-QTD-FALHAS.
       5400-FALHA-TIPO-INV SECTION.
           MOVE 'TIPO DE MOVIMENTO INVALIDO - ' TO WS-MSG-FALHA.
           MOVE MOV-CNT-ID TO WS-ID-FALHA.
           WRITE REG-FALHA FROM WS-LINHA-FALHA.
           ADD 1 TO WS-QTD-FALHAS.
       6000-GRAVAR-CONTA SECTION.
           WRITE REG-CNT-OUT FROM REG-CONTA.
           ADD 1 TO WS-QTD-CNT-PROC.
           MOVE CNT-ID TO WS-REL-CNT-ID.
           WRITE REG-RELATORIO FROM WS-LINHA-REL-1.
           MOVE WS-CNT-TOT-ENT TO WS-REL-ENTRADAS.
           WRITE REG-RELATORIO FROM WS-LINHA-REL-2.
           MOVE WS-CNT-TOT-SAI TO WS-REL-SAIDAS.
           WRITE REG-RELATORIO FROM WS-LINHA-REL-3.
           MOVE SPACES TO REG-RELATORIO.
           WRITE REG-RELATORIO.
       7000-FALHA-CONTA-INEX SECTION.
           MOVE 'CONTA NAO ENCONTRADA - '   TO WS-MSG-FALHA.
           MOVE MOV-CNT-ID                  TO WS-ID-FALHA.
           WRITE REG-FALHA FROM WS-LINHA-FALHA.
           ADD 1 TO WS-QTD-FALHAS.
       8000-ENCERRAR SECTION.
           MOVE ALL '*' TO REG-RELATORIO.
           WRITE REG-RELATORIO.
           MOVE 'RESUMO DO PROCESSAMENTO' TO REG-RELATORIO.
           WRITE REG-RELATORIO.
           MOVE ALL '*' TO REG-RELATORIO.
           WRITE REG-RELATORIO.
           MOVE 'CONTAS PROCESSADAS.......: ' TO WS-DESC-TOTAIS.
           MOVE WS-QTD-CNT-PROC TO WS-VALOR-TOTAIS.
           WRITE REG-RELATORIO FROM WS-LINHA-TOTAIS.
           MOVE 'MOVIMENTOS PROCESSADOS...: ' TO WS-DESC-TOTAIS.
           MOVE WS-QTD-MOV-PROC TO WS-VALOR-TOTAIS.
           WRITE REG-RELATORIO FROM WS-LINHA-TOTAIS.
           MOVE 'ENTRADAS PROCESSADAS.....: ' TO WS-DESC-TOTAIS.
           MOVE WS-QTD-ENTRADAS TO WS-VALOR-TOTAIS.
           WRITE REG-RELATORIO FROM WS-LINHA-TOTAIS.
           MOVE 'FALHAS ENCONTRADAS.......: ' TO WS-DESC-TOTAIS.
           MOVE WS-QTD-FALHAS TO WS-VALOR-TOTAIS.
           WRITE REG-RELATORIO FROM WS-LINHA-TOTAIS.
           MOVE 'FIM DO PROCESSAMENTO' TO REG-RELATORIO.
           WRITE REG-RELATORIO.
           CLOSE ARQ-CONTAS
                 ARQ-MOVIM
                 ARQ-CNT-OUT
                 RELATORIO
                 ARQ-FALHAS.