//PROCBC   JOB (EXEC),'PROC BANCARIO',CLASS=A,MSGCLASS=X,
//             MSGLEVEL=(1,1),USER=HERC01,PASSWORD=HERC01
//COMPILAR EXEC PGM=IKFCBL00,
//             PARM='LOAD,SUPMAP,SIZE=2048K,BUF=1024K,LIB'
//SYSLIB   DD  DSN=HERC01.COBOL.COPYLIB,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSPUNCH DD  SYSOUT=*
//SYSIN    DD  DSN=HERC01.COBOL.SOURCE(PROCESSA),DISP=SHR
//SYSLIN   DD  DSN=&&OBJSET,DISP=(MOD,PASS), 
//             UNIT=SYSDA,SPACE=(TRK,(10,10)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=3200)
//SYSUT1   DD  SPACE=(CYL,(1,1)),UNIT=SYSDA
//SYSUT2   DD  SPACE=(CYL,(1,1)),UNIT=SYSDA
//SYSUT3   DD  SPACE=(CYL,(1,1)),UNIT=SYSDA
//SYSUT4   DD  SPACE=(CYL,(1,1)),UNIT=SYSDA
//*
//LINKEDIT EXEC PGM=IEWL,PARM='LIST,LET,XREF,MAP',
//             COND=(5,LT,COMPILAR)        
//SYSLIN   DD  DSN=&&OBJSET,DISP=(OLD,DELETE)
//SYSLMOD  DD  DSN=HERC01.LOAD(CONTUPDT),DISP=SHR
//SYSLIB   DD  DSN=SYS1.COBLIB,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSUT1   DD  SPACE=(CYL,(1,1)),UNIT=SYSDA
//*
//ORDCNT   EXEC PGM=SORT,REGION=1024K
//STEPLIB  DD DSN=SYS1.LINKLIB,DISP=SHR
//SORTLIB  DD DSN=SYS1.SORTLIB,DISP=SHR
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DSN=HERC01.DADOS.CLIENTES,DISP=SHR
//SORTOUT  DD DSN=&&CNTSORT,DISP=(NEW,PASS),
//            UNIT=SYSDA,SPACE=(CYL,(1,1),RLSE),
//            DCB=(RECFM=FB,LRECL=44,BLKSIZE=4400)
//SYSIN    DD *
  SORT FIELDS=(1,5,CH,A)
/*
//ORDMOV   EXEC PGM=SORT,REGION=1024K
//STEPLIB  DD DSN=SYS1.LINKLIB,DISP=SHR
//SORTLIB  DD DSN=SYS1.SORTLIB,DISP=SHR
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DSN=HERC01.DADOS.TRANSAC,DISP=SHR
//SORTOUT  DD DSN=&&MOVSORT,DISP=(NEW,PASS),
//            UNIT=SYSDA,SPACE=(CYL,(1,1),RLSE),
//            DCB=(RECFM=FB,LRECL=20,BLKSIZE=2000)
//SYSIN    DD *
  SORT FIELDS=(1,5,CH,A)
/*
//EXECUTAR EXEC PGM=CONTUPDT
//STEPLIB  DD DSN=HERC01.LOAD,DISP=SHR
//ARQCNT   DD DSN=&&CNTSORT,DISP=(OLD,DELETE)
//ARQMOV   DD DSN=&&MOVSORT,DISP=(OLD,DELETE)
//CNTUPDT  DD DSN=HERC01.CONTAS.ATUALIZ,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(5,5),RLSE),UNIT=SYSDA,
//            DCB=(RECFM=FB,LRECL=44,BLKSIZE=4400)
//RELAT    DD DSN=HERC01.RELAT.TXT,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(2,2),RLSE),UNIT=SYSDA,
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//FALHAS   DD DSN=HERC01.FALHAS.TXT,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(1,1),RLSE),UNIT=SYSDA,
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//SYSUDUMP DD SYSOUT=*
//