      ******************************************************************
      * COPYBOOK: CLIENTE.CPY
      * DESCRICAO: LAYOUT DE ENTRADA DO ARQUIVO CLIENTES.TXT
      * USO: INCLUDE PARA LEITURA DO ARQUIVO SEQUENCIAL DE CLIENTES
      ******************************************************************
       01  REG-CLIENTE.
           05  CLI-ID              PIC 9(05).
           05  CLI-NOME            PIC X(30).
           05  CLI-SALDO           PIC 9(09).
